In [2]:
import pandas as pd
import numpy as np
from numpy.random import randn

# Pandas_Series

In [3]:
# You can convert a list,numpy array, or dictionary to a Series:
labels = ['a','b','c']
my_list = [10,20,30]
d = {'a':10,'b':20,'c':30}

list_to_series = pd.Series(data=my_list,index=labels)
dict_to_series = pd.Series(d)
list_to_series

a    10
b    20
c    30
dtype: int64

In [4]:
# extracting 1 element or more than 1 element using indicies.
list_to_series[['a', 'b']]

a    10
b    20
dtype: int64

# Pandas_DataFrames

In [5]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.859075  0.744972 -2.772965  0.331091
B -0.590490  0.812471  1.964240 -1.560327
C -0.469653  0.871436  0.763427  1.044876
D -2.309227  0.740756  1.152322  0.492631
E  0.143675 -0.942349 -1.052308  0.944530

In [6]:
# Extracting 1 or more column from a dataframe.
df[['W', 'X']]

          W         X
A  0.859075  0.744972
B -0.590490  0.812471
C -0.469653  0.871436
D -2.309227  0.740756
E  0.143675 -0.942349

In [7]:
# Creating a new column.
df['new'] = df['W'] + df["X"]
df

          W         X         Y         Z       new
A  0.859075  0.744972 -2.772965  0.331091  1.604047
B -0.590490  0.812471  1.964240 -1.560327  0.221981
C -0.469653  0.871436  0.763427  1.044876  0.401783
D -2.309227  0.740756  1.152322  0.492631 -1.568471
E  0.143675 -0.942349 -1.052308  0.944530 -0.798674

In [8]:
# drop 1 or more columns from a dataframe.
df.drop(['new', 'Z'],axis=1, inplace=True)
df

          W         X         Y
A  0.859075  0.744972 -2.772965
B -0.590490  0.812471  1.964240
C -0.469653  0.871436  0.763427
D -2.309227  0.740756  1.152322
E  0.143675 -0.942349 -1.052308

In [9]:
# drop 1 or more rows from a dataframe.
df.drop(['A', 'B'], axis=0, inplace=True)
df

          W         X         Y
C -0.469653  0.871436  0.763427
D -2.309227  0.740756  1.152322
E  0.143675 -0.942349 -1.052308

In [10]:
# selecting multiple rows and multiple columns.(use.loc() if you want to pick spacific rows in a dataframe.)
# u can use .iloc() for picking rows by default indicies(0, 1, 2, etc..)
df.loc[['C', 'E'], ['W', 'X']]

          W         X
C -0.469653  0.871436
E  0.143675 -0.942349

In [11]:
# selecting specific values in 1 column to filter the rows then picking another column or columns value/s of these rows.
df[df['X'] < 0][['W', 'Y']]

          W         Y
E  0.143675 -1.052308

In [12]:
# for multiple conditions on columns values use & or |
df[(df['W']>0) | (df['Y'] < 0)]

          W         X         Y
E  0.143675 -0.942349 -1.052308

In [13]:
# Reset the indices of the df and puts the old indicies in a column.
df.reset_index()

  index         W         X         Y
0     C -0.469653  0.871436  0.763427
1     D -2.309227  0.740756  1.152322
2     E  0.143675 -0.942349 -1.052308

In [14]:
# Set indicies of the df from a pandas series.
df['States'] = 'CA NY WY'.split()
df.set_index('States', inplace=True)
df

               W         X         Y
States
CA     -0.469653  0.871436  0.763427
NY     -2.309227  0.740756  1.152322
WY      0.143675 -0.942349 -1.052308

# Multi-index_DataFrame

In [15]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]

# puts the elements of the 2 lists in tuples.
hier_index = list(zip(outside,inside))
# groups all tuples together in a hierarchical multi-index.
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [16]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -0.267456  0.983215
   2 -1.111485 -0.075518
   3 -0.869213 -0.626217
G2 1  0.191804 -1.291419
   2 -1.008557 -1.144217
   3 -1.433256  1.009625

In [17]:
# goes 1 level down in indicies level.
df.loc['G1']

          A         B
1 -0.267456  0.983215
2 -1.111485 -0.075518
3 -0.869213 -0.626217

In [18]:
# set names to the indicies columns.
df.index.names = ['Group','Num']
df

                  A         B
Group Num
G1    1   -0.267456  0.983215
      2   -1.111485 -0.075518
      3   -0.869213 -0.626217
G2    1    0.191804 -1.291419
      2   -1.008557 -1.144217
      3   -1.433256  1.009625

In [19]:
# Gets a cross section of the dataframe the level being the indices column that u want to get an element cross section of.
df.xs(2, level="Num")

              A         B
Group
G1    -1.111485 -0.075518
G2    -1.008557 -1.144217

# Missing_Data

In [20]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [21]:
# Could drop either a row or a column that contains a null value.
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [22]:
# Setting a threshhold to drop a row iff there was less than 2 values available in the row.
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [23]:
# Filling the missing values with the mean of it's column.
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# GroupBy

In [24]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [25]:
# Using group by u have to first chose the column u want ur groups to be created of.
# Then u have to call an aggregate function on the group by object.
# Here it only groups the Sales column cuz it is the only numerical column.
df.groupby("Company").mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [26]:
# Here it groups both numeric and non-numeric columns just counting the number of times a column value was assigned to rows.
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [27]:
# Gets the sum of the sales of the facebook company.
df.groupby("Company").sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [28]:
df.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Concatenating DataFrames

In [29]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [30]:
# could concat. on either columns or rows.
pd.concat([df1,df2,df3],axis=0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# Merging

In [31]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4'],
                     'A': ['A0', 'A1', 'A2', 'A3', 'A4'],
                     'B': ['B0', 'B1', 'B2', 'B3', 'B4']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K5'],
                          'C': ['C0', 'C1', 'C2', 'C3', 'C5'],
                          'D': ['D0', 'D1', 'D2', 'D3', 'D5']})

In [32]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [33]:
pd.merge(left, right, how='outer', on='key')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K4   A4   B4  NaN  NaN
5  K5  NaN  NaN   C5   D5

In [34]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [35]:
# You could use merge on 2 df using outer, left, right, inner
# It is the same as sql Join.
pd.merge(left, right, how="left" , on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

# Dataframe Operations

In [36]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [37]:
# applies the whole lambda function through all rows in col1.
df['col1'] = df['col1'].apply(lambda x : x * 2)
df

   col1  col2 col3
0     2   444  abc
1     4   555  def
2     6   666  ghi
3     8   444  xyz

In [38]:
# gets all columns in a df.
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [39]:
# sorts depending on 1 or 2 columns.
df.sort_values(by=['col1', 'col2'])

   col1  col2 col3
0     2   444  abc
1     4   555  def
2     6   666  ghi
3     8   444  xyz

In [40]:
unique_col_values = df['col1'].unique()
number_col_unique_values = df['col1'].nunique()

In [47]:
# Returns a Series containing counts of unique values in a descending order with the most frequent on top.
df['col1'].value_counts()

6    1
4    1
2    1
8    1
Name: col1, dtype: int64

In [49]:
# gets the correlation between 2 or all columns in a dataframe.
df[['col1',"col2"]].corr("pearson")

         col1     col2
col1  1.00000  0.13484
col2  0.13484  1.00000

In [51]:
# Returns number of elements in each column of a dataframe
df.count()

col1    4
col2    4
col3    4
dtype: int64

In [ ]:
# I use sum here when i want to count the number of True conditions for my conditional statement below on a column.
# Checking whether the expirey date contains 25 in it or not if true it will be added to the sum.
# sum(ecom["CC Exp Date"].apply(lambda d: "25" in d))